<unk>
<sos>
<eos>
,
.
and
the
is
a
of
in
Yancheng
The
it
It
for
food
with
``
''
as
you
can
local
dish
rice
specialty
people
fat
not
from
made
liquor
flavor
Dazong
Lake
your
to
Dongtai
Fish
Soup
Noodle
Jiangsu
low
Wuyou
Liquor
Saturated
by
sweet
fresh
Qinnan
meat
tender
are
delicious
Omelet
that
’
s
traditional
Province
will
noodle
refreshing
good
high
various
taste
In
first
Buffalo
lake
crab
Funing
Big
Cake
years
sticky
greasy
famous
Dagang
Salted
Goose
city
where
enjoy
's
delicacy
many
dishes
has
other
breakfast
omelet
You
every
classic
recipe
cooked
Han
goes
features
protein
or
way
Snail
soaking
back
(
)
shell
was
China
medal
big
Chinese
Cooked
Water
savory
tasty
certification
Crab
Huaiyang
crabs
an
white
salt
A
looks
if
still
be
cake
its
must
Jianhu
Lotus
Root
Starch
Rice
Ball
Traditional
balls
fruits
nuts
ago
Four-gilled
Perch
Sugar
Twist
but
Delicacies
open
heart
also
place
beautiful
scenery
most
importantly
!
Xiaolu
recommendations
How
have
tried
?
top-ranking
short
history
compared
Over
past
decade
joints
refined
suit
tastes
now
become
find
booths
selling
day
milk
commuters
wheaten
As
saying
Have
bowl
live
longer
than
God
Longevity
soup
creamy
thick
digestion
abundant
active
calcium
amino
acids
suffer
inflammation
feel
thirsty
after
eating
Eating
regularly
stay
fit
healthy
mud
snails
preserving
them
period
time
dates
Ming
Dynasty
A.D.
1368
-
1644
Characterized
soft
transparent
rich
bouquet
balance
salty
this
pairs
well
1982
listed
National
Tourism
Administration
Honored
High-quality
1985
1990
awarded
silver
Food
Expo
1988
name
culture
boast
century-old
town
Following
secret
Ha
family
top-quality
buffalo
Haxin
Meet
got
halal
Ethnic
Religious
Affairs
Committee
attained
national
pollution-free
agro-product
2004
There
verse
which
autumn
season
when
chrysanthemum
Sweet
Osmanthus
blossom
living
Region
praise
here
refers
1910
claimed
prize
Nanyang
Industrial
Exposition
Crabs
wide
deep
average
weight
0.1-0.15kg
biggest
weights
0.25kg
verdant
belly
yellow
hair
golden
claws
high-quality
wine
Huai
pepper
star
anise
processed
alive
Its
special
With
aromatic
smell
perfect
dated
400
snow-white
thin
paper
piece
ignited
Traditionally
raw
materials
During
Spring
Festival
household
symbolizes
luck
prosperity
If
nibble
lingering
without
feeling
too
Rich
nutrition
beneficial
both
blood
bones
dozen
banquet
Today
refreshment
main
places
especially
rural
areas
included
list
Grade-II
protected
aquatic
wildlife
species
ranks
among
Four
Freshwater
Fishes
entitled
No.1
fish
Jiangnan
Originated
over
100
snack
like
two
circling
dragons
Unlike
dough
twists
inside
break
completely
dropped
mere
height
one
foot
delicate-looking
well-known
crispy
pickled
Cuisine
popular
Yangtze
River
Basin
north
river
natural
ingredients
using
advanced
processing
methods
goose
health
cholesterol
proportion
lean
does
contain
any
synthetic
fragrance
chemical
preservative
fragrant
unique
hot-seller
shops
